app/Controllers/RentCarController.php

SELECT *
FROM `rentcar`
---
    public function indexA()
    {
        $data['cars'] = $this->rentCarModel->findAll();