app/Controllers/TripCalculatorController.php

    public function index()
    {
        $data['wisata'] = $this->wisataModel->findAll();
---
SELECT *
FROM `wisata`