app/Controllers/TripController.php

    public function create()
    {
        if (!session()->get('isLoggedIn')) {
            return redirect()->to('/kerlyn/login');
        }

        $data['wisata'] = $this->wisataModel->findAll();
---
SELECT *
FROM `wisata`