app/Controllers/VendorController.php

SELECT *
FROM `vendor`
---
    public function indexA()
    {
        $model = new Vendor();
        $data['vendors'] = $model->findAll();