app/Models/TripModel.php

SELECT *
FROM `trips`
WHERE `userId` = '2'
ORDER BY `start_date` DESC
---
    public function getTripsByUser($userId)
    {
        return $this->where('userId', $userId)
                    ->orderBy('start_date', 'DESC')
                    ->findAll();