app/Models/UserModel.php

    public function getUserByUsername(string $username) {
        return $this->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'kerlyn'
 LIMIT 1