app/Models/WisataModel.php

    public function getWisataWithRating()
    {
        return $this->orderBy('wisataRating', 'DESC')->findAll();
---
SELECT *
FROM `wisata`
ORDER BY `wisataRating` DESC

    public function getTopRated()
    {
        return $this->orderBy('wisataRating', 'DESC')
                    ->limit(5)
                    ->find();
---
SELECT *
FROM `wisata`
ORDER BY `wisataRating` DESC
 LIMIT 5

    public function getMostReviewed()
    {
        return $this->orderBy('totalReview', 'DESC')
                    ->limit(5)
                    ->find();
---
SELECT *
FROM `wisata`
ORDER BY `totalReview` DESC
 LIMIT 5